Revit 2024 API
ParameterTypeId.PreferDimSideUiFilter Property
 "Prefer:": This is used by the UI to allow select prefer dimension side.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId PreferDimSideUiFilter { get; }
Visual Basic
Public Shared ReadOnly Property PreferDimSideUiFilter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PreferDimSideUiFilter {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace